SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Application/Device/MM32F5370/Include/reg_dac.h
/**
  * @brief DAC_DHR8RD Register Bit Definition
  */
#define  DAC_DHR8RD_DACC1DHR_Pos                  (0)
#define  DAC_DHR8RD_DACC1DHR_Msk                  (0xFFU << DAC_DHR8RD_DACC1DHR_Pos)                /*!<DAC Channel 1 8-bit Right Aligned Data*/
#define  DAC_DHR8RD_DACC1DHR                      DAC_DHR8RD_DACC1DHR_Msk
#define  DAC_DHR8RD_DACC1DHR_Bit0                 (0x01U << DAC_DHR8RD_DACC1DHR_Pos) 
#define  DAC_DHR8RD_DACC1DHR_Bit1                 (0x02U << DAC_DHR8RD_DACC1DHR_Pos) 
#define  DAC_DHR8RD_DACC1DHR_Bit2                 (0x04U << DAC_DHR8RD_DACC1DHR_Pos) 
#define  DAC_DHR8RD_DACC1DHR_Bit3                 (0x08U << DAC_DHR8RD_DACC1DHR_Pos) 
#define  DAC_DHR8RD_DACC1DHR_Bit4                 (0x10U << DAC_DHR8RD_DACC1DHR_Pos) 
#define  DAC_DHR8RD_DACC1DHR_Bit5                 (0x20U << DAC_DHR8RD_DACC1DHR_Pos) 
#define  DAC_DHR8RD_DACC1DHR_Bit6                 (0x40U << DAC_DHR8RD_DACC1DHR_Pos) 
#define  DAC_DHR8RD_DACC1DHR_Bit7                 (0x80U << DAC_DHR8RD_DACC1DHR_Pos) 
#define  DAC_DHR8RD_DACC2DHR_Pos                  (8)
#define  DAC_DHR8RD_DACC2DHR_Msk                  (0xFFU << DAC_DHR8RD_DACC2DHR_Pos)                /*!<DAC Channel 2 8-bit Right Aligned Data*/
#define  DAC_DHR8RD_DACC2DHR                      DAC_DHR8RD_DACC2DHR_Msk
#define  DAC_DHR8RD_DACC2DHR_Bit0                 (0x01U << DAC_DHR8RD_DACC2DHR_Pos) 
#define  DAC_DHR8RD_DACC2DHR_Bit1                 (0x02U << DAC_DHR8RD_DACC2DHR_Pos) 
#define  DAC_DHR8RD_DACC2DHR_Bit2                 (0x04U << DAC_DHR8RD_DACC2DHR_Pos) 
#define  DAC_DHR8RD_DACC2DHR_Bit3                 (0x08U << DAC_DHR8RD_DACC2DHR_Pos) 
#define  DAC_DHR8RD_DACC2DHR_Bit4                 (0x10U << DAC_DHR8RD_DACC2DHR_Pos) 
#define  DAC_DHR8RD_DACC2DHR_Bit5                 (0x20U << DAC_DHR8RD_DACC2DHR_Pos) 
#define  DAC_DHR8RD_DACC2DHR_Bit6                 (0x40U << DAC_DHR8RD_DACC2DHR_Pos) 
#define  DAC_DHR8RD_DACC2DHR_Bit7                 (0x80U << DAC_DHR8RD_DACC2DHR_Pos) 

/**
  * @brief DAC_DOR1 Register Bit Definition
  */
#define  DAC_DOR1_DACC1DOR_Pos                    (0)
#define  DAC_DOR1_DACC1DOR_Msk                    (0xFFFU << DAC_DOR1_DACC1DOR_Pos)                 /*!<DAC Channel 1 Data Output*/
#define  DAC_DOR1_DACC1DOR                        DAC_DOR1_DACC1DOR_Msk
#define  DAC_DOR1_DACC1DOR_Bit0                   (0x001U << DAC_DOR1_DACC1DOR_Pos) 
#define  DAC_DOR1_DACC1DOR_Bit1                   (0x002U << DAC_DOR1_DACC1DOR_Pos) 
#define  DAC_DOR1_DACC1DOR_Bit2                   (0x004U << DAC_DOR1_DACC1DOR_Pos) 
#define  DAC_DOR1_DACC1DOR_Bit3                   (0x008U << DAC_DOR1_DACC1DOR_Pos) 
#define  DAC_DOR1_DACC1DOR_Bit4                   (0x010U << DAC_DOR1_DACC1DOR_Pos) 
#define  DAC_DOR1_DACC1DOR_Bit5                   (0x020U << DAC_DOR1_DACC1DOR_Pos) 
#define  DAC_DOR1_DACC1DOR_Bit6                   (0x040U << DAC_DOR1_DACC1DOR_Pos) 
#define  DAC_DOR1_DACC1DOR_Bit7                   (0x080U << DAC_DOR1_DACC1DOR_Pos) 
#define  DAC_DOR1_DACC1DOR_Bit8                   (0x100U << DAC_DOR1_DACC1DOR_Pos) 
#define  DAC_DOR1_DACC1DOR_Bit9                   (0x200U << DAC_DOR1_DACC1DOR_Pos) 
#define  DAC_DOR1_DACC1DOR_Bit10                  (0x400U << DAC_DOR1_DACC1DOR_Pos) 
#define  DAC_DOR1_DACC1DOR_Bit11                  (0x800U << DAC_DOR1_DACC1DOR_Pos) 

/**
  * @brief DAC_DOR2 Register Bit Definition
  */
#define  DAC_DOR2_DACC2DOR_Pos                    (0)
#define  DAC_DOR2_DACC2DOR_Msk                    (0xFFFU << DAC_DOR2_DACC2DOR_Pos)                 /*!<DAC Channel 2 Data Output*/
#define  DAC_DOR2_DACC2DOR                        DAC_DOR2_DACC2DOR_Msk
#define  DAC_DOR2_DACC2DOR_Bit0                   (0x001U << DAC_DOR2_DACC2DOR_Pos) 
#define  DAC_DOR2_DACC2DOR_Bit1                   (0x002U << DAC_DOR2_DACC2DOR_Pos) 
#define  DAC_DOR2_DACC2DOR_Bit2                   (0x004U << DAC_DOR2_DACC2DOR_Pos) 
#define  DAC_DOR2_DACC2DOR_Bit3                   (0x008U << DAC_DOR2_DACC2DOR_Pos) 
#define  DAC_DOR2_DACC2DOR_Bit4                   (0x010U << DAC_DOR2_DACC2DOR_Pos) 
#define  DAC_DOR2_DACC2DOR_Bit5                   (0x020U << DAC_DOR2_DACC2DOR_Pos) 
#define  DAC_DOR2_DACC2DOR_Bit6                   (0x040U << DAC_DOR2_DACC2DOR_Pos) 
#define  DAC_DOR2_DACC2DOR_Bit7                   (0x080U << DAC_DOR2_DACC2DOR_Pos) 
#define  DAC_DOR2_DACC2DOR_Bit8                   (0x100U << DAC_DOR2_DACC2DOR_Pos) 
#define  DAC_DOR2_DACC2DOR_Bit9                   (0x200U << DAC_DOR2_DACC2DOR_Pos) 
#define  DAC_DOR2_DACC2DOR_Bit10                  (0x400U << DAC_DOR2_DACC2DOR_Pos) 
#define  DAC_DOR2_DACC2DOR_Bit11                  (0x800U << DAC_DOR2_DACC2DOR_Pos) 


#endif

